/* ----------------------------------------------------------------------------------------------- */
/*  Copyright (c) 2021 by Axel Kenzo, axelkenzo@mail.ru                                            */
/*                                                                                                 */
/*  Прикладной модуль, реализующий процедуры шифрования файлов с использованием                    */
/*  криптографических алгоритмов из библиотеки libakrypt                                           */
/*                                                                                                 */
/*  aktool_encrypt.c                                                                               */
/* ----------------------------------------------------------------------------------------------- */
 #include <stdio.h>
 #include <stdlib.h>
 #include <string.h>
 #include <aktool.h>

 int aktool_encrypt( int argc, char *argv[], encrypt_t type )
{
   return EXIT_FAILURE;
}



/* ----------------------------------------------------------------------------------------------- */
/*                                                                               aktool_encrypt.c  */
/* ----------------------------------------------------------------------------------------------- */
