/* ----------------------------------------------------------------------------------------------- */
/*  Copyright (c) 2019 - 2020 by Axel Kenzo, axelkenzo@mail.ru                                     */
/*                                                                                                 */
/*  Файл ak_context_manager.h                                                                      */
/*  - содержит описание функций, реализующих механизмы хранения ключей                             */
/* ----------------------------------------------------------------------------------------------- */
#ifndef __AK_KEY_MANAGER_H__
#define __AK_KEY_MANAGER_H__

/* ----------------------------------------------------------------------------------------------- */
 #include <libakrypt.h>

/* ----------------------------------------------------------------------------------------------- */
 #define key_manager_blob_size  ( 4096 )

/* ----------------------------------------------------------------------------------------------- */
 struct key_manager;
 typedef struct key_manager *ak_key_manager;

/* ----------------------------------------------------------------------------------------------- */
 typedef int ( ak_function_key_manager_add )( ak_key_manager , const char * , crypto_content_t );

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Класс, реализующий произвольный менеджер управления ключами                             */
/*! \details Любой менеджер управления ключами должен предоставлять следующий набор функций
    - сохранение готового (созданного независимо от менеджера ключей) ключевого контейнера.
                                                                                                   */
/* ----------------------------------------------------------------------------------------------- */
 struct key_manager {
  /* статическая область памяти для размещения данных */
   ak_uint8 blob[ key_manager_blob_size ];

  /*! \brief Указатель на функцию добавления ключевого контейнера */
   ak_function_key_manager_add *add_container;
};

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Функция создает менеджер управления ключами, расположенными в заданном каталоге. */
 int ak_key_manager_context_create_in_directory( ak_key_manager , const char * );
/*! \brief Функция уничтожает менеджер управления ключами. */
 int ak_key_manager_context_destroy( ak_key_manager );

#endif
/* ----------------------------------------------------------------------------------------------- */
/*                                                                               ak_key_manager.h  */
/* ----------------------------------------------------------------------------------------------- */
