/* ----------------------------------------------------------------------------------------------- */
 #ifndef __AK_NETWORK_H__
 #define __AK_NETWORK_H__

/* ----------------------------------------------------------------------------------------------- */
 #include <libakrypt.h>

/* ----------------------------------------------------------------------------------------------- */
/*! \brief  Определение сокета, не зависящее от типа операционной системы. */
#ifdef LIBAKRYPT_HAVE_WINDOWS_H
 typedef SOCKET ak_socket;
 #define ak_socket_undefined  (INVALID_SOCKET)

#else
 typedef int ak_socket;
 #define ak_socket_undefined  (-1)

#endif

/* ----------------------------------------------------------------------------------------------- */
/*! \brief  Тип функции низкого уровня для чтения из сокета. */
 typedef ssize_t ( fiot_function_socket_write )( ak_socket , const void *, size_t );
/*! \brief  Тип функции низкого уровня для записи в сокета. */
 typedef ssize_t ( fiot_function_socket_read )( ak_socket , void *, size_t );

#endif
/* ----------------------------------------------------------------------------------------------- */
/*                                                                                   ak_network.h  */
/* ----------------------------------------------------------------------------------------------- */
