/* ----------------------------------------------------------------------------------------------- */
/*  Copyright (c) 2014 - 2018 by Axel Kenzo, axelkenzo@mail.ru                                     */
/*                                                                                                 */
/*  Файл ak_omac.h                                                                                 */
/*  - содержит описания функций, реализующих алгоритм выработки имитовставки ГОСТ Р 34.13-2015.    */
/* ----------------------------------------------------------------------------------------------- */
#ifndef __AK_OMAC_H__
#define __AK_OMAC_H__

/* ----------------------------------------------------------------------------------------------- */
 #include <ak_bckey.h>

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Секретный ключ алгоритма выработки имитовставки ГОСТ Р 34.13-2015. */
/*!  Алгоритм выработки имитовставки ГОСТ Р 34.13-2015 представляет собой адаптацию алгоритма
     OMAC1/CMAC для отечественных алгоритмов блочного шифрования Магма и Кузнечик
     (см. также NIST Special Publication 800-38B Recommendation for Block Cipher Modes of Operation:
     [The CMAC Mode for Authentication](https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-38b.pdf). */
/* ----------------------------------------------------------------------------------------------- */
 typedef struct omac {
 /*! \brief Контекст секретного ключа алгоритма блочного шифрования. */
  struct bckey bkey;
 /*! \brief Вектор с промежуточным значением имитовставки. */
  struct buffer yaout;
} *ak_omac;

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Создание контекста алгоритма выработки имитовставки ГОСТ Р 34.13-2015 на основе
    блочного шифра Магма. */
 int ak_omac_context_create_magma( ak_omac );
/*! \brief Создание контекста алгоритма выработки имитовставки ГОСТ Р 34.13-2015 на основе
    блочного шифра Кузнечик. */
 int ak_omac_context_create_kuznechik( ak_omac );
/*! \brief Создание контекста алгоритма выработки имитовставки ГОСТ Р 34.13-2015
    c помощью заданного oid. */
 int ak_omac_context_create_oid( ak_omac , ak_oid );
/*! \brief Уничтожение контекста алгоритма выработки имитовставки ГОСТ Р 34.13-2015. */
 int ak_omac_context_destroy( ak_omac );
/*! \brief Освобождение памяти из под контекста алгоритма выработки имитовставки ГОСТ Р 34.13-2015. */
 ak_pointer ak_omac_context_delete( ak_pointer );

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Присвоение секретному ключу константного значения. */
 int ak_omac_context_set_key( ak_omac , const ak_pointer , const size_t , const ak_bool );
/*! \brief Присвоение секретному ключу случайного значения. */
 int ak_omac_context_set_key_random( ak_omac , ak_random );
/*! \brief Присвоение секретному ключу значения, выработанного из пароля */
 int ak_omac_context_set_key_from_password( ak_omac , const ak_pointer , const size_t ,
                                                                 const ak_pointer , const size_t );
/* ----------------------------------------------------------------------------------------------- */
/*! \brief Очистка контекста секретного ключа алгоритма выработки имитовставки ГОСТ Р 34.13-2015,
    а также проверка ресурса ключа. */
 int ak_omac_context_clean( ak_pointer );
/*! \brief Обновление текущее состояние контекста алгоритма выработки имитовставки omac. */
 int ak_omac_context_update( ak_pointer , const ak_pointer , const size_t );
/*! \brief Завершение алгоритма выработки имитовставки omac. */
 ak_buffer ak_omac_context_finalize( ak_pointer , const ak_pointer , const size_t , ak_pointer );
/*! \brief Вычисление имитовставки для заданной области памяти. */
 ak_buffer ak_omac_context_ptr( ak_omac , const ak_pointer , const size_t , ak_pointer );
/*! \brief Вычисление имитовставки для заданного файла. */
 ak_buffer ak_omac_context_file( ak_omac , const char*, ak_pointer );

#endif
/* ----------------------------------------------------------------------------------------------- */
/*                                                                                   ak_omac.h  */
/* ----------------------------------------------------------------------------------------------- */

