/* ----------------------------------------------------------------------------------------------- */
/*   Copyright (c) 2010-2016 by Axel Kenzo, axelkenzo@mail.ru                                      */
/*   All rights reserved.                                                                          */
/*                                                                                                 */
/*   Redistribution and use in source and binary forms, with or without modification, are          */
/*   permitted provided that the following conditions are met:                                     */
/*                                                                                                 */
/*   1. Redistributions of source code must retain the above copyright notice, this list of        */
/*      conditions and the following disclaimer.                                                   */
/*   2. Redistributions in binary form must reproduce the above copyright notice, this list of     */
/*      conditions and the following disclaimer in the documentation and/or other materials        */
/*      provided with the distribution.                                                            */
/*   3. Neither the name of the copyright holder nor the names of its contributors may be used     */
/*      to endorse or promote products derived from this software without specific prior written   */
/*      permission.                                                                                */
/*                                                                                                 */
/*   THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS   */
/*   OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF               */
/*   MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL        */
/*   THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, */
/*   EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE */
/*   GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED    */
/*   AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING     */
/*   NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED  */
/*   OF THE POSSIBILITY OF SUCH DAMAGE.                                                            */
/*                                                                                                 */
/*   ak_parameters.h                                                                               */
/* ----------------------------------------------------------------------------------------------- */
#ifndef    __AK_PARAMETERS_H__
#define    __AK_PARAMETERS_H__

/* ----------------------------------------------------------------------------------------------- */
 #include <ak_hash.h>
 #include <ak_curves.h>

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Тестовые значения перестановок для алгоритма шифрования ГОСТ 28147-89 (Магма)           */
 static const kbox cipher_box = {
                { 4, 2, 15, 5, 9, 1, 0, 8, 14, 3, 11, 12, 13, 7, 10, 6 },
                { 12, 9, 15, 14, 8, 1, 3, 10, 2, 7, 4, 13, 6, 0, 11, 5 },
                { 13, 8, 14, 12, 7, 3, 9, 10, 1, 5, 2, 4, 6, 15, 0, 11 },
                { 14, 9, 11, 2, 5, 15, 7, 1, 0, 13, 12, 6, 10, 4, 3, 8 },
                { 3, 14, 5, 9, 6, 8, 0, 13, 10, 11, 7, 12, 2, 1, 15, 4 },
                { 8, 15, 6, 11, 1, 9, 12, 5, 13, 3, 7, 10, 0, 14, 2, 4 },
                { 9, 11, 12, 0, 3, 6, 7, 5, 4, 8, 14, 15, 1, 10, 2, 13 },
                { 12, 6, 5, 2, 11, 0, 9, 13, 3, 14, 7, 10, 15, 4, 1, 8 }
};

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Фиксированные значения перестановок для алгоритма шифрования ГОСТ 28147-89 (Магма)
    Значения таблиц взяты из ГОСТ Р 34.12-2015                                                     */
 static const kbox cipher_box_magma = {
                { 12, 4, 6, 2, 10, 5, 11, 9, 14, 8, 13, 7, 0, 3, 15, 1 },
                { 6, 8, 2, 3, 9, 10, 5, 12, 1, 14, 4, 7, 11, 13, 0, 15 },
                { 11, 3, 5, 8, 2, 15, 10, 13, 14, 1, 7, 4, 12, 9, 6, 0 },
                { 12, 8, 2, 1, 13, 4, 15, 6, 7, 0, 10, 5, 3, 14, 9, 11 },
                { 7, 15, 5, 10, 8, 1, 6, 13, 0, 9, 3, 14, 11, 4, 2, 12 },
                { 5, 13, 15, 6, 9, 2, 12, 10, 11, 7, 8, 1, 4, 3, 14, 0 },
                { 8, 14, 2, 5, 6, 9, 1, 12, 15, 4, 11, 0, 13, 10, 3, 7 },
                { 1, 7, 14, 13, 0, 5, 8, 3, 4, 15, 10, 6, 9, 12, 11, 2 }
};

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Фиксированные значения перестановок для алгоритма шифрования ГОСТ 28147-89 (Магма)
    Значения перестановок взяты из RFC 4357                                                        */
 static const kbox cipher_box_CSPA = {
               { 9, 6, 3, 2, 8, 11, 1, 7, 10, 4, 14, 15, 12, 0, 13, 5 },
               { 3, 7, 14, 9, 8, 10, 15, 0, 5, 2, 6, 12, 11, 4, 13, 1 },
               { 14, 4, 6, 2, 11, 3, 13, 8, 12, 15, 5, 10, 0, 7, 1, 9 },
               { 14, 7, 10, 12, 13, 1, 3, 9, 0, 2, 11, 4, 15, 8, 5, 6 },
               { 11, 5, 1, 9, 8, 13, 15, 0, 14, 4, 2, 3, 12, 7, 10, 6 },
               { 3, 10, 13, 12, 1, 2, 0, 11, 7, 5, 9, 4, 8, 15, 14, 6 },
               { 1, 13, 2, 9, 7, 10, 6, 0, 8, 12, 4, 5, 15, 3, 11, 14 },
               { 11, 10, 15, 5, 0, 12, 14, 8, 6, 2, 3, 9, 1, 7, 13, 4 }
};

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Перестановки со значениями по-умолчанию для алгоритма бесключевого хеширования.
    Определены ГОСТР Р 34.11-94, приложение А.                                                     */
 static const kbox hash_box = {
                { 4, 10, 9, 2, 13, 8, 0, 14, 6, 11, 1, 12, 7, 15, 5, 3 },
                { 14, 11, 4, 12, 6, 13, 15, 10, 2, 3, 8, 1, 0, 7, 5, 9 },
                { 5, 8, 1, 13, 10, 3, 4, 2, 14, 15, 12, 7, 6, 0, 9, 11 },
                { 7, 13, 10, 1, 0, 8, 9, 15, 14, 4, 6, 12, 11, 2, 5, 3 },
                { 6, 12, 7, 1, 5, 15, 13, 8, 4, 10, 9, 14, 0, 3, 11, 2 },
                { 4, 11, 10, 0, 7, 2, 1, 13, 3, 6, 8, 5, 9, 12, 15, 14 },
                { 13, 11, 4, 1, 3, 15, 5, 9, 0, 10, 14, 7, 6, 8, 2, 12 },
                { 1, 15, 13, 0, 5, 7, 10, 4, 9, 2, 3, 14, 6, 11, 8, 12 }
};

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Перестановки для алгоритма хеширования ГОСТ Р 34.11-94.
    Набор параметров А компании КриптоПро                                                          */
 static const kbox hash_box_CSPA = {
                { 10, 4, 5, 6, 8, 1, 3, 7, 13, 12, 14, 0, 9, 2, 11, 15 },
                { 5, 15, 4, 0, 2, 13, 11, 9, 1, 7, 6, 3, 12, 14, 10, 8 },
                { 7, 15, 12, 14, 9, 4, 1, 0, 3, 11, 5, 2, 6, 10, 8, 13 },
                { 4, 10, 7, 12, 0, 15, 2, 8, 14, 1, 6, 5, 13, 11, 9, 3 },
                { 7, 6, 4, 11, 9, 12, 2, 10, 1, 8, 0, 14, 15, 13, 3, 5 },
                { 7, 6, 2, 4, 13, 9, 15, 0, 10, 1, 5, 11, 8, 14, 12, 3 },
                { 13, 14, 4, 1, 7, 0, 5, 10, 3, 12, 8, 15, 6, 2, 9, 11 },
                { 1, 3, 10, 9, 5, 11, 4, 15, 8, 6, 7, 14, 13, 0, 2, 12 }
};

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Перестановки для алгоритма хеширования ГОСТ Р 34.11-94.
    Набор параметров средства ВербаО                                                               */
 static const kbox hash_box_VerbaO = {
                { 3, 6, 7, 8, 2, 5, 12, 14, 9, 13, 0, 10, 1, 11, 4, 15 },
                { 1, 13, 6, 2, 9, 10, 4, 3, 7, 14, 5, 11, 12, 0, 15, 8 },
                { 7, 15, 12, 3, 0, 13, 10, 5, 14, 9, 11, 2, 4, 1, 6, 8 },
                { 11, 4, 9, 1, 6, 8, 13, 10, 0, 3, 7, 14, 5, 12, 15, 2 },
                { 3, 15, 10, 0, 2, 5, 11, 6, 9, 14, 1, 8, 13, 12, 7, 4 },
                { 13, 9, 4, 11, 7, 12, 8, 3, 10, 2, 1, 15, 5, 6, 0, 14 },
                { 1, 4, 9, 3, 10, 0, 15, 2, 7, 12, 11, 13, 14, 6, 8, 5 },
                { 4, 10, 8, 11, 1, 13, 14, 6, 9, 2, 12, 15, 7, 0, 5, 3 }
};

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Параметры эллиптической кривой из тестового примера ГОСТ Р 34.10-2012 */
 static const struct wcurve_params wcurve_GOST = {
  ak_mpzn256_size,
  "7",                                                                // a
  "5FBFF498AA938CE739B8E022FBAFEF40563F6E6A3472FC2A514C0CE9DAE23B7E", // b
  "8000000000000000000000000000000000000000000000000000000000000431", // p
  "8000000000000000000000000000000150FE8A1892976154C59CFC193ACCF5B3", // q
  "2",                                                                // px
  "8E2A8A0E65147D4BD6316030E16D19C85C97F0A9CA267122B96ABBCEA7E8FC8",  // py
  "464584",                                                           // r2
  0xDBF951D5883B2B2FLL,                                               // n
  1                                                                   // d
};

#endif
/* ----------------------------------------------------------------------------------------------- */
/*                                                                                 ak_parameters.h */
/* ----------------------------------------------------------------------------------------------- */
