/* ----------------------------------------------------------------------------------------------- */
/*  Copyright (c) 2014 - 2019 by Axel Kenzo, axelkenzo@mail.ru                                     */
/*                                                                                                 */
/*  Файл ak_tools.h                                                                                */
/*  - содержит описания служебных функций и переменных, не экспортируемых за пределы библиотеки    */
/* ----------------------------------------------------------------------------------------------- */
 #ifndef    __AK_TOOLS_H__
 #define    __AK_TOOLS_H__

/* ----------------------------------------------------------------------------------------------- */
 #include <stdio.h>
 #include <libakrypt.h>

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Структура данных для хранения дескриптора и параметров файла (используется переносимая реализация через libc). */
 typedef struct file {
 /*! \brief Дескриптор файла. */
  FILE *fp;
 /*! \brief Размер файла. */
  ak_int64 size;
 /*! \brief Размер блока для оптимального чтения с жесткого диска. */
  ak_int64 blksize;
 } *ak_file;

/* ----------------------------------------------------------------------------------------------- */
 int ak_file_open_to_read( ak_file , const char * );
 int ak_file_create_to_write( ak_file , const char * );

/*! \brief Функция закрывает файл с заданным дескриптором. */
 int ak_file_close( ak_file );

/* ----------------------------------------------------------------------------------------------- */
/*! \brief Функция устанавливает уровень аудита. */
 int ak_log_set_level( int );

/*! \brief Функция устанавливает значение опции с заданным именем. */
 int ak_libakrypt_set_option( const char *name, const ak_int64 value );
/*! \brief Функция возвращает значение опции с заданным именем. */
 ak_int64 ak_libakrypt_get_option( const char *name );
/*! \brief Функция считывает настройки (параметры) библиотеки из файла libakrypt.conf */
 ak_bool ak_libakrypt_load_options( void );

 #endif
/* ----------------------------------------------------------------------------------------------- */
/*                                                                                 ak_libakrypt.h  */
/* ----------------------------------------------------------------------------------------------- */
