/* ----------------------------------------------------------------------------------------------- */
/*  Copyright (c) 2014 - 2018 by Axel Kenzo, axelkenzo@mail.ru                                     */
/*                                                                                                 */
/*  Файл akrypt.c                                                                                  */
/*  - содержит объявления служебных функций консольного клиента                                    */
/* ----------------------------------------------------------------------------------------------- */
 #ifndef AKRYPT_H
 #define AKRYPT_H

/* ----------------------------------------------------------------------------------------------- */
 #include <libakrypt.h>
 #ifdef _WIN32
  #include <tchar.h>
  #include <strsafe.h>
 #else
  #define TCHAR char
 #endif

/* ----------------------------------------------------------------------------------------------- */
 #ifdef LIBAKRYPT_HAVE_LIBINTL_H
  #include <libintl.h>
  #define _( string ) gettext( string )
 #else
  #define _( string ) ( string )
 #endif

/* ----------------------------------------------------------------------------------------------- */
/* вывод очень короткой справки о программе */
 int akrypt_litehelp( void );
/* вывод длинной справки о программе */
 int akrypt_help( void );
/* проверка корректности заданной пользователем команды */
 ak_bool akrypt_check_command( const char *, TCHAR * );

/* ----------------------------------------------------------------------------------------------- */
/* реализации пользовательских команд */
 int akrypt_icode( int argc, TCHAR *argv[] );
 int akrypt_show( int argc, TCHAR *argv[] );

 #endif
/* ----------------------------------------------------------------------------------------------- */
/*                                                                                       akrypt.h  */
/* ----------------------------------------------------------------------------------------------- */
